INSERT INTO dishes (name, type_dishes, image, preparation_time, technology) VALUES (
	'Яичные конвертики с сыром и ветчиной',
	'Закуска',
	CONVERT(VARBINARY(MAX), '\\FYR-Server\COMMON\31ИПо8381\DataBases\Zharkov_v12\database\img\big_378723.jpg'),
	20, 
	'Натрите ветчину и сыр на мелкой тёрке.В отдельную ёмкость разбейте яйца и слегка взбейте вилкой, чтобы белки и желтки смешались. Для удобства дальнейшего приготовления можно взбивать и обжаривать по одному яйцу за раз, но тогда блинчики получатся чуть более толстыми.Разогрейте сковороду на среднем огне и смажьте растительным маслом. Влейте порцию взбитых яиц и распределите по сковороде, чтобы получился тонкий яичный блинчик. Жарьте блинчик примерно 1-2 минуты, пока яичная масса не "схватится".Затем переверните яичный блинчик на другую сторону. В центр блинчика выложите немного ветчины и натёртого сыра. У меня получается 5 тонких или 4 толстых блинчика, поэтому начинку я делю соответственно на 4-5 частей и распределяю между блинчиками.Сверните яичный блинчик с начинкой конвертиком. Для этого сперва подверните свободные края блинчика слева и справа от начинки и сложите по направлению к центру. Прижмите края блинчика лопаткой на 10-15 секунд, чтобы зафиксировать их в таком положении.Затем таким же образом подверните верхний и нижний края блинчика. Слегка прижимая лопаткой, обжарьте получившийся конвертик ещё 20-30 секунд.Затем переверните яичный конвертик и обжарьте ещё 20-30 секунд с другой стороны. Повторите процесс с оставшейся яичной массой и начинкой. Аппетитные яичные конвертики с сыром и ветчиной готовы. При желании срежьте выступающие края конвертиков, придав им более аккуратную форму. Украсьте блюдо измельчённой зеленью и подавайте к столу.'
	
), (
	'Картофель по-деревенски',
	'Закуска',
	CONVERT(VARBINARY(MAX), '\\FYR-Server\COMMON\31ИПо8381\DataBases\Zharkov_v12\database\img\big_592041.jpg'),
	30, 
	'
Картофель хорошо промываем под проточной водой. У меня картофель молодой, так что я буду готовить его прямо в кожуре. Ставим кастрюлю с водой на плиту и доводим её до кипения. Пока вода закипает, давайте займёмся нарезкой картофеля. Каждый клубень необходимо разрезать примерно на 8 равных частей.
Дольки картофеля помещаем в кипящую воду. Ждём, пока она снова закипит. Варим картофель 4 минуты.
Извлекаем дольки картофеля из кипящей воды. И раскладываем их на бумажном полотенце, стараясь, чтобы они не соприкасались друг с другом. Даём им остыть и обсохнуть.
В это время готовим смесь специй. В миске соединяем сладкую паприку, куркуму, гранулированный чеснок, свежемолотый перец, соль. Добавляем растительное масло, чтобы специям было проще раскрыть свой аромат. Перемешиваем все ингредиенты.
Подсохшие и остывшие картофельные дольки помещаем в миску большого размера. Добавляем к ним смесь специй. Перемешиваем содержимое миски так, чтобы специи обволакивали каждую дольку картофеля со всех сторон. Рекомендую делать это аккуратно, стараясь не повредить подваренный картофель. Затем оставляем его помариноваться на несколько минут.
В это время включаем духовку разогреваться до 250 градусов.
Противень застилаем бумагой для выпечки. И выкладываем на него дольки картофеля кожурой вниз. Обязательно выкладывать картофель таким образом, чтобы дольки не соприкасались друг с другом.
Помещаем противень в духовку и запекаем картошку 20 минут.Готовый картофель по-деревенски подаём к столу горячим.'
),(
	'Картофельные драники',
	'Основное блюдо',
	CONVERT(VARBINARY(MAX), '\\FYR-Server\COMMON\31ИПо8381\DataBases\Zharkov_v12\database\img\big_173505.jpg'),
	45, 
	'Как приготовить драники (деруны):

Картофель очищаем и натираем на крупной терке, сразу выкладываем на сито или дуршлаг. Отжимаем 

Добавляем яйца, соль, перец. Перемешиваем.

Жарим картофельные драники на среднем огне в достаточном количестве растительного масла до румяности с обеих сторон.
Подаем картофельные драники со сметаной или с яблочным пюре.'
), (
	'Джамбалайя',
	'Основное блюдо',
	CONVERT(VARBINARY(MAX), '\\FYR-Server\COMMON\31ИПо8381\DataBases\Zharkov_v12\database\img\big_359494.jpg'),
	30, 
	'Подготавливаем необходимые ингредиенты.
	На помидорах делаем крестообразные надрезы. Заливаем помидоры кипятком и отставляем, пока будем заниматься другими овощами.
	Очищенный лук нарезаем мелкими кубиками.
Очищенный чеснок мелко рубим ножом
Сладкий болгарский перец освобождаем от плодоножек и семян и нарезаем небольшими кусочками.
Помидоры очищаем от шкурки и нарезаем кубиками.
Сосиски очищаем от упаковочной плёнки и нарезаем кружочками.
На растительном масле обжариваем сосиски. Отставляем пока в сторону.
В посуде, в которой будем готовить джамбалайю (подойдёт глубокая сковорода или сотейник), разогреваем растительное масло. Обжариваем лук до прозрачности.
Добавляем к луку сладкий перец и слегка обжариваем.
Добавляем помидоры, чеснок и томатную пасту. Солим и перчим.
Туда же добавляем сосиски и рис. Перемешиваем и заливаем горячей водой. Вода должна быть выше содержимого сковороды или сотейника примерно на 1,5-2 см.
Убавляем огонь, накрываем крышкой и тушим до готовности риса.
Готовое блюдо посыпаем рубленой зеленью петрушки.'
), (
	'Сырный суп с копчеными колбасками',
	'Основное блюдо',
	CONVERT(VARBINARY(MAX), '\\FYR-Server\COMMON\31ИПо8381\DataBases\Zharkov_v12\database\img\big_359494.jpg'),
	30, 
	'Подготовить ингредиенты для сырного супа с колбасками.

Овощи очистить и нарезать.
В казанке обжарить чеснок на растительном масле несколько секунд. Сразу добавить лук и морковь, жарить до прозрачности.
Добавить колбаски, жарить пару минут. Добавить картофель. Жарить, помешивая, около 10 минут. Посолить по вкусу.
Залить в казанок воду и варить суп с колбасками и овощами около 15 минут, до готовности картофеля.
Натереть плавленый сырок на крупной терке. Добавить в суп плавленый сыр, мешать до полного растворения сыра.
Выключить огонь и добавить в сырный суп рубленую зелень.
Сырный суп с колбасками подавать с сухариками.'
);

INSERT INTO products (name, calories, weight, price) VALUES ('Сосиски', 200.73, 100, 100)
,('Рис', 14, 1000, 120)
, ('Лук репчатый', 100.73, 1000, 51)
,('Перец болгарский', 10.73, 100, 450)
,('Помидоры', 410.73, 100, 350)
, ('Чеснок', 10.73, 100, 20)
, ('Томатная паста', 210.73, 100, 520)
, ('Морковь', 13.73, 1000, 31)
, ('Картофель', 100.73, 600, 50)
, ('Соль', 0, 1000, 50)
,('Перец молотый', 0.73, 10, 50)
,('Яйца', 50.23, 100, 9.5)
,('Ветчина', 100.73, 600, 50)
, ('Масло растительное', 70.5, 1000, 50)
, ('Сыр твёрдый', 300.73, 100, 500)
, ('Петрушка свежая', 0.3, 10, 10)
, ('Паприка молотая', 10.73, 10, 40)
,('Куркума', 30.73, 10, 43)
, ('Чеснок гранулированный', 30.73, 100, 433)
, ('Сырок плавленый', 140.1, 100, 320)
, ('Колбаски копченые', 135.1, 100, 221)
, ('Сухарики', 735.1, 100, 721)
INSERT INTO cooking (dishes_id, portions) VALUES (
	(SELECT id FROM dishes WHERE name LIKE 'Яичные конвертики с сыром и ветчиной'),
	4
), (
	(SELECT id FROM dishes WHERE name LIKE 'Яичные конвертики с сыром и ветчиной'),
	2
), (
	(SELECT id FROM dishes WHERE name LIKE 'Картофельные драники'),
	7
), (
	(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
	2
), (
	(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
	1
), (
	(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
	4
), (
	(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
	4
);




INSERT INTO structures (dishes_id, product, weight) VALUES (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Сосиски'),
400)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Рис'),
350)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Лук репчатый'),
80)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Перец болгарский'),
200)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Помидоры'),
300)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Томатная паста'),
50)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Масло растительное'),
60)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Петрушка свежая'),
10)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Соль'),
1)
, (
(SELECT id FROM dishes WHERE name LIKE 'Джамбалайя'),
(SELECT id FROM products WHERE name LIKE 'Перец молотый'),
1)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
(SELECT id FROM products WHERE name LIKE 'Паприка молотая'),
2)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
(SELECT id FROM products WHERE name LIKE 'Куркума'),
1)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
(SELECT id FROM products WHERE name LIKE 'Чеснок гранулированный'),
4)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
(SELECT id FROM products WHERE name LIKE 'Картофель'),
1000)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
(SELECT id FROM products WHERE name LIKE 'Перец болгарский'),
200)
,
(
(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
(SELECT id FROM products WHERE name LIKE 'Перец молотый'),
2)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофель по-деревенски'),
(SELECT id FROM products WHERE name LIKE 'Соль'),
1)
, (
(SELECT id FROM dishes WHERE name LIKE 'Яичные конвертики с сыром и ветчиной'),
(SELECT id FROM products WHERE name LIKE 'Яйца'),
400)
,(
(SELECT id FROM dishes WHERE name LIKE 'Яичные конвертики с сыром и ветчиной'),
(SELECT id FROM products WHERE name LIKE 'Ветчина'),
130)
, (
(SELECT id FROM dishes WHERE name LIKE 'Яичные конвертики с сыром и ветчиной'),
(SELECT id FROM products WHERE name LIKE 'Сыр твёрдый'),
100)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофельные драники'),
(SELECT id FROM products WHERE name LIKE 'Картофель'),
1500)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофельные драники'),
(SELECT id FROM products WHERE name LIKE 'Яйца'),
200)
,(
(SELECT id FROM dishes WHERE name LIKE 'Картофельные драники'),
(SELECT id FROM products WHERE name LIKE 'Соль'),
1)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофельные драники'),
(SELECT id FROM products WHERE name LIKE 'Перец молотый'),
1)
, (
(SELECT id FROM dishes WHERE name LIKE 'Картофельные драники'),
(SELECT id FROM products WHERE name LIKE 'Масло растительное'),
10), (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Сырок плавленый'),
190), (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Колбаски копченые'),
150), (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Картофель'),
300), (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Морковь'),
100), (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Лук репчатый'),
200), (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Чеснок'),
30), (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Масло растительное'),
10)
, (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Петрушка свежая'),
10)
, (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Соль'),
1)
, (
(SELECT id FROM dishes WHERE name LIKE 'Сырный суп с копчеными колбасками'),
(SELECT id FROM products WHERE name LIKE 'Сухарики'),
40)


SELECT * FROM dishes
SELECT * FROM products
SELECT * FROM structures
SELECT * FROM cooking

